ebay/ebay-connector/ebay-connector-1.0.0/org.wso2.carbon.connector/src/test/resources/artifacts/ESB/config/requests/ebay/esb_setPromotionalSaleListings_optional.xml

<!--
   Copyright (c) 2005-2015, WSO2 Inc. (http://www.wso2.org) All Rights Reserved.

   WSO2 Inc. licenses this file to you under the Apache License,
   Version 2.0 (the "License"); you may not use this file except
   in compliance with the License.
   You may obtain a copy of the License at

   http://www.apache.org/licenses/LICENSE-2.0

   Unless required by applicable law or agreed to in writing,
   software distributed under the License is distributed on an
   "AS IS" BASIS, WITHOUT WARRANTIES OR CONDITIONS OF ANY
   KIND, either express or implied. See the License for the
   specific language governing permissions and limitations
   under the License.
-->

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:urn="wso2.connector.ebay">
	<soapenv:Header></soapenv:Header>
	<soapenv:Body>
		<urn:apiUrl>%s(tradingApiUrl)</urn:apiUrl>
		<urn:appId>%s(appId)</urn:appId>
		<urn:version>%s(version)</urn:version>
		<urn:routing>%s(routing)</urn:routing>
		<urn:siteId>%s(siteId)</urn:siteId>
		<urn:authToken>%s(authToken)</urn:authToken>
		<urn:action>Add</urn:action>
		<urn:promotionalSaleID>%s(promotionalSaleId)</urn:promotionalSaleID>
		<urn:promotionalSaleItemIDArray xmlns:ebl="urn:ebay:apis:eBLBaseComponents">
			<ebl:values>
				<ebl:ItemID>%s(itemIdSecondary)</ebl:ItemID>
				<ebl:ItemID>%s(itemIdMandatory)</ebl:ItemID>
			</ebl:values>
		</urn:promotionalSaleItemIDArray>
		<!-- Send Connector method name to be called -->
		<urn:method>setPromotionalSaleListings</urn:method>
	</soapenv:Body>
</soapenv:Envelope>
